In [7]:
import pandas as pd

In [2]:
data = {
    '도시': ['서울', '서울', '서울', 
           '부산', '부산', '부산', 
           '인천', '인천'],
    '연도':['2015', '2010', '2005',
         '2015', '2010', '2005',
         '2015', '2010'],
    '인구':[9904312, 9631482, 9762546,
         3448737, 3393191, 3512547,
         2890451, 2632035],
    '지역':['수도권', '수도권', '수도권',
         '경상권', '경상권', '경상권',
         '수도권', '수도권']
}

In [3]:
data

{'도시': ['서울', '서울', '서울', '부산', '부산', '부산', '인천', '인천'],
 '연도': ['2015', '2010', '2005', '2015', '2010', '2005', '2015', '2010'],
 '인구': [9904312,
  9631482,
  9762546,
  3448737,
  3393191,
  3512547,
  2890451,
  2632035],
 '지역': ['수도권', '수도권', '수도권', '경상권', '경상권', '경상권', '수도권', '수도권']}

In [4]:
columns = ['도시', '연도', '인구', '지역']

In [5]:
columns

['도시', '연도', '인구', '지역']

In [8]:
df1 = pd.DataFrame(data, columns=columns)

In [9]:
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [10]:
result = df1.pivot('도시', '연도', '인구')

In [11]:
result

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632035.0  2890451.0

In [12]:
df1['도시']

0    서울
1    서울
2    서울
3    부산
4    부산
5    부산
6    인천
7    인천
Name: 도시, dtype: object

In [13]:
df1['도시']=='인천'

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
Name: 도시, dtype: bool

In [15]:
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [16]:
df1[df1['도시']=='인천']

   도시    연도       인구   지역
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [17]:
df1[df1['연도']=='2005']

   도시    연도       인구   지역
2  서울  2005  9762546  수도권
5  부산  2005  3512547  경상권

In [18]:
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [19]:
df1.set_index(['도시', '연도'])

              인구   지역
도시 연도
서울 2015  9904312  수도권
   2010  9631482  수도권
   2005  9762546  수도권
부산 2015  3448737  경상권
   2010  3393191  경상권
   2005  3512547  경상권
인천 2015  2890451  수도권
   2010  2632035  수도권

In [22]:
df1.set_index(['도시', '연도'])[['인구']]

              인구
도시 연도
서울 2015  9904312
   2010  9631482
   2005  9762546
부산 2015  3448737
   2010  3393191
   2005  3512547
인천 2015  2890451
   2010  2632035

In [21]:
type(df1.set_index(['도시', '연도'])['인구'])

pandas.core.series.Series

In [23]:
type(df1.set_index(['도시', '연도'])[['인구']])

pandas.core.frame.DataFrame

In [24]:
df1.set_index(['도시', '연도'])[['인구']].unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632035.0  2890451.0

In [25]:
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [26]:
result = df1.pivot('지역', '연도', '인구')

ValueError: Index contains duplicate entries, cannot reshape

In [27]:
df1[df1['지역']=='수도권']

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [28]:
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [29]:
df1['인구']

0    9904312
1    9631482
2    9762546
3    3448737
4    3393191
5    3512547
6    2890451
7    2632035
Name: 인구, dtype: int64

In [31]:
df1['인구'].groupby([df1['지역'], df1['연도']])

In [32]:
df1['인구'].groupby([df1['지역'], df1['연도']]).sum()

지역   연도
경상권  2005     3512547
     2010     3393191
     2015     3448737
수도권  2005     9762546
     2010    12263517
     2015    12794763
Name: 인구, dtype: int64

In [34]:
df1[df1['지역']=='수도권']

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [37]:
df1[df1['연도']=='2015']

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
3  부산  2015  3448737  경상권
6  인천  2015  2890451  수도권

In [38]:
(df1['지역']=='수도권') & (df1['연도']=='2015')

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [39]:
df1[(df1['지역']=='수도권') & (df1['연도']=='2015')]

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
6  인천  2015  2890451  수도권

In [40]:
result = df1['인구'].groupby([df1['지역'], df1['연도']]).sum().unstack('연도')

In [41]:
result

연도      2005      2010      2015
지역
경상권  3512547   3393191   3448737
수도권  9762546  12263517  12794763